app/views/users/show.html.erb

<table>
  <% @user.ratings.each do |reittaus| %>
---
SELECT  "ratings".* FROM "ratings"  WHERE "ratings"."user_id" = ?  ORDER BY "ratings"."id" ASC LIMIT 1  [["user_id", 1]]

<table>
  <% @user.beerclubs.each do |klubi| %>
---
SELECT  "beerclubs".* FROM "beerclubs" INNER JOIN "memberships" ON "beerclubs"."id" = "memberships"."beerclub_id" WHERE "memberships"."user_id" = ?  ORDER BY "beerclubs"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT  "beers".* FROM "beers"   ORDER BY "beers"."id" ASC LIMIT 1