app/views/ratings/index.html.erb

    <ul>
    <% Rating.recent.each do |rating| %>
---
SELECT "ratings".* FROM "ratings"

  <% User.best_raters.each do |user| %>
      <li> <%= user.username + ' - ' + user.ratings.count.to_s %> ratings</li>
---
SELECT COUNT(*) FROM "ratings"