app/views/beers/_form.html.erb

  <div class="field">
    <%= f.select :style, options_for_select(@styles) %>
---
SELECT "styles".* FROM "styles"