app/views/beers/show.html.erb

SELECT  1 AS one FROM "ratings"  WHERE "ratings"."beer_id" = ? LIMIT 1  [["beer_id", 1]]
---

<% if @beer.ratings.empty? %>