app/controllers/beerclubs_controller.rb

SELECT "beerclubs".* FROM "beerclubs"
---
  def index
    @beerclubs = Beerclub.all

SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."user_id" = 7 AND "memberships"."beerclub_id" = 2  ORDER BY "memberships"."id" ASC LIMIT 1
---
  def show
    if (@beerclub.isMember(current_user.id, @beerclub.id))
      @membership = Membership.where(beerclub_id: @beerclub.id).first

INSERT INTO "beerclubs" ("city", "created_at", "founded", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city", "Kerava"], ["created_at", "2015-02-01 07:07:58.264673"], ["founded", 2015], ["name", "Keravan bisseklubi"], ["updated_at", "2015-02-01 07:07:58.264673"]]
---
  def create
    @beerclub = Beerclub.new(beerclub_params)

    respond_to do |format|
      if @beerclub.save

SELECT  "beerclubs".* FROM "beerclubs"  WHERE "beerclubs"."id" = ? LIMIT 1  [["id", 2]]
---
  def set_beerclub
    @beerclub = Beerclub.find(params[:id])