app/controllers/beers_controller.rb

  def create

    modifiedParams = beer_params;
    modifiedParams["style"] = Style.where(name: beer_params["style"]).first;
    @beer = Beer.new(modifiedParams)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("created_at", "name", "style", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-07 22:32:32.483058"], ["name", "testikalja"], ["style", "Weizen"], ["updated_at", "2015-02-07 22:32:32.483058"]]