app/controllers/beers_controller.rb

  def new
    @beer = Beer.new
    @brewery = Brewery.all
---
SELECT  "breweries".* FROM "breweries"   ORDER BY "breweries"."id" ASC LIMIT 1

  def edit
    @brewery = Brewery.all
---
SELECT "breweries".* FROM "breweries"

  def set_breweries_and_styles_for_template
    @styles = []
    Style.all.each do |s|
---
SELECT "styles".* FROM "styles"

  def create

    modifiedParams = beer_params;
    modifiedParams["style"] = Style.where(name: beer_params["style"]).first;
    @beer = Beer.new(modifiedParams)

    respond_to do |format|
      if @beer.save
        format.html {  redirect_to beers_url, notice: 'Beer was successfully created.' }
        format.json { render :show, status: :created, location: @beer }
      else
        @beer = Beer.new
        @brewery = Brewery.all
---
SELECT  "styles".* FROM "styles"  WHERE "styles"."name" = 'Weizen'  ORDER BY "styles"."id" ASC LIMIT 1
INSERT INTO "beers" ("brewery_id", "created_at", "name", "style_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 1], ["created_at", "2015-02-15 10:24:58.546552"], ["name", "ULIULI"], ["style_id", 4], ["updated_at", "2015-02-15 10:24:58.546552"]]
SELECT "breweries".* FROM "breweries"

  def update
    respond_to do |format|
      if @beer.update(beer_params)
---
UPDATE "beers" SET "style" = ?, "updated_at" = ? WHERE "beers"."id" = 14  [["style", "Weizen"], ["updated_at", "2015-01-24 18:34:49.000872"]]