app/controllers/breweries_controller.rb

INSERT INTO "breweries" ("created_at", "name", "updated_at", "year") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-15 15:55:07.266270"], ["name", "test"], ["updated_at", "2015-01-15 15:55:07.266270"], ["year", 2014]]
---
  def create
    @brewery = Brewery.new(brewery_params)

    respond_to do |format|
      if @brewery.save