app/controllers/memberships_controller.rb

SELECT "memberships".* FROM "memberships"
---
  def index
    @memberships = Membership.all

SELECT "beerclubs".* FROM "beerclubs"
---
  def new
    @beerclub = Beerclub.all

SELECT  "beerclubs".* FROM "beerclubs"  WHERE "beerclubs"."id" = ? LIMIT 1  [["id", 0]]
INSERT INTO "memberships" ("beer_club_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["beer_club_id", 1], ["created_at", "2015-02-01 07:50:47.534241"], ["updated_at", "2015-02-01 07:50:47.534241"], ["user_id", 1]]
SELECT  "beerclubs".* FROM "beerclubs"   ORDER BY "beerclubs"."id" ASC LIMIT 1
---
  def create
    @membership = Membership.new(membership_params)
    beerclubID = @membership.beerclub_id
    @beerclub = Beerclub.find(beerclubID)
    respond_to do |format|
      if @membership.save
        format.html { redirect_to @beerclub, notice: 'Welcome to the club '+ current_user.username }
        format.json { render :show, status: :created, location: @membership }
      else
        @beerclub = Beerclub.all

SELECT  "beerclubs".* FROM "beerclubs"  WHERE "beerclubs"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "beerclubs" WHERE "beerclubs"."id" = ?  [["id", 1]]
DELETE FROM "memberships" WHERE "memberships"."id" = ?  [["id", 1]]
---
  def destroy
    beerclubID = @membership.beerclub_id
    @beerclub = Beerclub.find(beerclubID)
    @membership.destroy