app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("beer_id", "created_at", "score", "updated_at") VALUES (?, ?, ?, ?)  [["beer_id", 1], ["created_at", "2015-01-24 16:57:33.062188"], ["score", 10], ["updated_at", "2015-01-24 16:57:33.062188"]]
SELECT "beers".* FROM "beers"
---
  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id)

    if current_user.nil?
      redirect_to signin_path, notice: 'you should be signed in'
    elsif @rating.save
      current_user.ratings << @rating
      redirect_to user_path current_user
    else
      @beers = Beer.all

SELECT  "ratings".* FROM "ratings"  WHERE "ratings"."id" = ? LIMIT 1  [["id", 10]]
DELETE FROM "ratings" WHERE "ratings"."id" = 10
---
  def destroy
    rating = Rating.find params[:id]
    rating.delete if current_user == rating.user