app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", "2015-02-01 01:56:40.682020"], ["updated_at", "2015-02-01 01:56:40.682020"], ["username", "Kalle"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
---
  def destroy
    if current_user == @user
      @user.destroy